Feature: Избираме проект над който да работим

  Background: 
    Given В системата влизаме с профил на обикновен дев

  Scenario: Избираме нова задача
    When Избираме проект над който да работим
    And Избираме задача която е нова
    Then Вижда съобщение "Избрахте нова задача"

  Scenario: Избираме задача в процес на разработка
    When Избираме проект над който да работим
    And Избираме задача която е в процес на разработка
    Then Вижда съобщение "Избрахте задача в процес на разработка"
    
    Scenario: Избираме готова задача
    When Избираме проект над който да работим
    And Избираме задача която е готова
    Then Вижда съобщение "Избрахте задача, която е готова"
    
    Scenario: Избираме отказана задача
    When Избираме проект над който да работим
    And Избираме задача която е отказана
    Then Вижда съобщение "Избрахте задача, която е отказана"
    
    
    

